#!/usr/bin/perl

use strict;
use Encode;
use utf8;

use File::Find;

main();

sub main()
{
   my $home = $ENV{"HOME"};
   my $TextDir = $home."/data/TDNET/mk_txt/";
   my @TextList;
   find( sub{ push(@TextList,$File::Find::name) if(-f $_); },$TextDir);


   foreach my $file (sort @TextList){     #file単位のループ
       my @data=split(/\//, $file);      #filename
       #print encode_utf8("$data[7],");

       open(my $in, $file);
       my $flag=0;     #ラベル付いたならループ終了のflag
       my $sflag=0;    #子会社のflag
       my $japanese=0; #日本語が含まれているかどうか
       while(my $line=decode_utf8(<$in>)){       #1行単位のループ、ラベル付
         if($line==""){last;}
	       chomp($line);
         if($line=~/[\p{Han}\p{Hiragana}\p{Katakana}]/){$japanese=1;}
         else{next;}

	       #[文字列マッチング]

	       #"子会社"のワードがあればsflagをたてる
         if($line=~/子会社/ &&($line=~/お知らせ$/ || $line=~/ついて$/)){
           if($line!~"子会社化"){$sflag=1;}
         }

    	   #    〜上場会社の情報〜
         if($sflag==0){
  	       #[1] 上場会社の決定事実
  	       if($line=~(
           "発行する株式" || "処分する自己株式" || "発行する新株予約権" || "処分する自己新株予約権" #1
           || "発行登録" ||"需要状況調査" #2
           || "資本金" #3
           || "資本準備金" || "利益準備金" #4
           || "自己株式の取得" #5
           || "株式無償割当て" ||"新株予約権無償割当て" #6
           || "見込み調査" #7
           || "株式の分割" || "株式の併合" #8
           || "剰余金" #9
           || "組織再編" #10
           || "公開買付け" #11
           || "意見表明" #12
           || ("事業" && ("譲渡" || "譲受け")) #13
           || "解散" #14
           || "企業化" #15
           || "提携" #16
           || "株式の譲渡" || "株式の取得" || "子会社化" #17
           || "固定資産" #18
           || ("事業" && ("休止" || "廃止")) #19
           || "上場廃止申請" #20
           || ("新"&&"事業")#22
           || "代表取締役" || "代表執行役" #23
           || "合理化" #24
           || "商号" || "名称" #25
           || "単元株式数" #26
           || "決算期変更" #27
           || "債務超過"#28
           || "調停"#29
           || " 繰上償還" #30
           || "承認申請書" #33
           || "株式事務の委託" #34
           || "内部統制報告書" #35
           || "定款" #36
           || "全部取得条項付種類株式" #37
           )){print encode_utf8("$data[7],0 上場会社の決定事実\n"); $flag++; last;}

  	       #2 上場会社の発生事実
  	       if($line=~(
           "損害"#1
           ||"主要株主" || "筆頭株主" #2
           || "上場廃止" #3
           ||"訴訟"||"判決"#4
           ||"仮処分命令"#5
           ||("免許"&&"取消し")||("事業"&&"停止")||"告発"#6
           ||(("親会社"||"支配株主"||"関係会社")&&"異動")#7
           ||"不渡り"||"手形交換所"#9
           ||"取立不能"||"取立遅延"#11
           ||"取引停止"#12
           ||"債務免除"||"金融支援"#13
           ||"資源の発見"#14
           || "発行差止請求" #16
           || "株主総会" #17
           || "保有有価証券" #18
           || "利益の喪失" #19
           || "提出遅延" #22
           || "提出期限延長申請" #23
           || "監査報告書" #24 25
           || "株式事務代行委託契約の解除通知" #26
           )){print encode_utf8("$data[7],1 上場会社の発生事実\n"); $flag++; last;}

  	       #3 上場会社の決算情報
  	       if($line=~"決算短信"){print encode_utf8("$data[7],2 上場会社の決算情報\n"); $flag++; last;}

  	       #4 上場会社の業績予想、配当予想の修正
  	       if($line=~(
           "業績予想" || "予想値" || "決算値" #1
           || "配当予想" #2
           )){print encode_utf8("$data[7],3 上場会社の業績予想、配当予想の修正等\n"); $flag++; last;}

  	       #5 その他の情報
  	       if($line=~(
           "投資単位の引下げ" #1
           || "財務会計基準機構" #2
           || "MSCB" #3
           || "非上場の親会社" #5
           || "事業計画" || "成長可能性" #6
           || "上場維持基準" #7
           )){print encode_utf8("$data[7],4 その他の情報\n"); $flag++; last;}
         }
         else{       #〜子会社等の情報〜
	           #6 子会社等の決定事実
           if($line=~(
           "組織再編" #1
           || "公開買付け" #2
           || ("事業" && ("譲渡" || "譲受け")) #3
           || "解散" #4
           || "企業化" #5
           || "提携" #6
           || "固定資産" #8
           || ("事業" && ("休止" || "廃止")) #9
           || ("新"&&"事業")#11
           || ("商号"||"名称")#12
           || "債務超過"#13
           || "調停"#14
           )){print encode_utf8("$data[7],5 子会社等の決定事実\n"); $flag++; last;}

             #7 子会社等の発生事実
           if($line=~(
           "損害"#1
           ||"訴訟"||"判決"#2
           ||"仮処分命令"#3
           ||("免許"&&"取消し")||("事業"&&"停止")||"告発"#4
           ||"不渡り"||"手形交換所"#6
           ||"取立不能"||"取立遅延"#8
           ||"取引停止"#9
           ||"債務免除"||"金融支援"#10
           ||"資源の発見"#11
           )){print encode_utf8("$data[7],6 子会社等の発生事実\n"); $flag++; last;}

	           #8 子会社等の業績予想
           if($line=~("業績予想" || "予想値" || "決算値")){print encode_utf8("$data[7],7 子会社等の業績予想の修正等\n"); $flag++; last;}
	       }
       }
       if($japanese==0){next;}
       if($flag==0){print encode_utf8("$data[7],\n");}
   }
}
